#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

data.archive_file.source_file_zip: Reading...
data.archive_file.source_file_zip: Read complete after 0s [id=38854abc43b0a575eb3614ab9a69a201da005ea7]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_cloudfunctions2_function.function will be updated in-place
  ~ resource "google_cloudfunctions2_function" "function" {
        id          = "projects/github-actions-378014/locations/asia-northeast1/functions/test-function"
        name        = "test-function"
        # (7 unchanged attributes hidden)

      ~ build_config {
            # (4 unchanged attributes hidden)

          ~ source {

              ~ storage_source {
                  ~ object     = "dev/test-function_416ad2d2aa9c4aace1eb837fae57e7ce.zip" -> "dev/test-function_c617f242f5aa8ab2872606361e55ed44.zip"
                    # (2 unchanged attributes hidden)
                }
            }
        }

        # (1 unchanged block hidden)
    }

  # google_storage_bucket_object.source_object_zip must be replaced
-/+ resource "google_storage_bucket_object" "source_object_zip" {
      ~ content_type     = "application/zip" -> (known after apply)
      ~ crc32c           = "AWDTrQ==" -> (known after apply)
      ~ detect_md5hash   = "QWrS0qqcSqzh64N/rlfnzg==" -> "different hash" # forces replacement
      - event_based_hold = false -> null
      ~ id               = "test-function_functions_src-dev/test-function_416ad2d2aa9c4aace1eb837fae57e7ce.zip" -> (known after apply)
      + kms_key_name     = (known after apply)
      ~ md5hash          = "QWrS0qqcSqzh64N/rlfnzg==" -> (known after apply)
      ~ media_link       = "https://storage.googleapis.com/download/storage/v1/b/test-function_functions_src/o/dev%2Ftest-function_416ad2d2aa9c4aace1eb837fae57e7ce.zip?generation=1676558298010022&alt=media" -> (known after apply)
      - metadata         = {} -> null
      ~ name             = "dev/test-function_416ad2d2aa9c4aace1eb837fae57e7ce.zip" -> "dev/test-function_c617f242f5aa8ab2872606361e55ed44.zip" # forces replacement
      ~ output_name      = "dev/test-function_416ad2d2aa9c4aace1eb837fae57e7ce.zip" -> (known after apply)
      ~ self_link        = "https://www.googleapis.com/storage/v1/b/test-function_functions_src/o/dev%2Ftest-function_416ad2d2aa9c4aace1eb837fae57e7ce.zip" -> (known after apply)
      ~ storage_class    = "STANDARD" -> (known after apply)
      - temporary_hold   = false -> null
        # (2 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @y-tsuritani, Action: `pull_request`, Working Directory: `terraform/dev`, Workflow: `caller terraform plan workflow (dev)`*